[
    {"review_id":"A1","user_id":"U1","business_id":"A","stars":1.0,"text":"Skip this train wreck if you are looking for dinner.  Our server was clueless...like we seriously thought she was lost in the restaurant.  Had to ask for setups, water refills, etc.  Ordered chicken parmesan and got eggplant parmesan instead with a fish bone in it.  The drinks were good.","date":"2018-02-11 03:11:20"},
    {"review_id":"A2","user_id":"U2","business_id":"A","stars":4.0,"text":"Stopped by to munch a burger during today's Seahawks/Saints game, and the place was, unsurprisingly, packed. For good reason, too: the Haven burger I ordered was fantastic.\\n\\nI sat right next to the door, so I didn't get the chance to get more than six feet into the place; as soon as I got my meal, the place started getting busier and busier until I had to work my way through the World's Shortest People Maze to get out. Guess that means I wasn't the first person to hear about the place.\\n\\nI will be going back to the Haven. Might go for, say lunch on a Tuesday, so it's less busy.","date":"2024-01-08 23:52:22"},
    {"review_id":"A3","user_id":"U3","business_id":"A","stars":5.0,"text":"We stopped in for brunch and we weren't expecting the food to be so delicious.  The 3 meat hash was amazing, as was the turkey sandwich and bagel/salmon.  The employees were very friendly and accommodating.  A little pricey, but well worth.  We will visit again if in the area.","date":"2023-08-05 18:45:00"},
    {"review_id":"A4","user_id":"U4","business_id":"A","stars":5.0,"text":"The depot burger is so delicious along with the shishito peppers! Perfect food, perfect atmosphere, perfect drinks!","date":"2025-09-12 21:00:00"},
    {"review_id":"A5","user_id":"U5","business_id":"A","stars":2.0,"text":"Walked into the restaurant, with reservations, and many open tables.  I asked the manager for a window table and was responded with \"they are all reserved.\"  Two hours later, when we left, still many open tables next to the windows.\\n\\nOverall food was good.\\nI had the filet and she had the salmon.\\nThe bottle of wine that was recommended was $75 and was not told prior to ordering it, just that it was the last bottle.","date":"2025-10-08 19:30:00"},
    {"review_id":"A6","user_id":"U6","business_id":"A","stars":5.0,"text":"My boyfriend and I tried this deli for the first time today. I had a turkey, avocado & bacon panini and he ha a buffalo chicken wrap. We will definitely be returning. The wait for food wasn't too long, which is always appreciated during lunch hour. There was SO much to choose from. They have salads, soup, macaroni, sandwiches and hot food. I love a deli that has many options to choose from!","date":"2024-11-14 20:00:00"},
    {"review_id":"A7","user_id":"U7","business_id":"A","stars":2.0,"text":"We started with the artichoke dip, big mistake. It was cold and the chips were stale. Mentioned to our waitress, but nothing came of it.  We ordered a large pizza, thin crust which after adding toppings it was a bit pricey for pizza.  Pizza was ok, not great. Except for not being our advocate our server was good.  I have been here before for Cardinals game, it was better then. Will try another venue next time.","date":"2024-12-03 19:15:00"},
    {"review_id":"A8","user_id":"U8","business_id":"A","stars":5.0,"text":"It has become our \"go to\" spot. The food is excellent and the service was great. The owner Jose is very friendly and tries to visit every table to make sure everyone is satisfied.  Tonight we had 2 Paellas, salmon and a filet mignon. Everything was made to order, cooked to perfection and came out hot.  \\n\\nThe family also opened a cafe in front of the restaurant. Jose gave us a tour and introduced us to his daughter that runs the cafe. The baked goods and coffees at the cafe are just as good as the meals at Carisma. Good, fresh food prepared and served by nice people. Try Carisma, it's so much more than just the normal tacos and burritos. You wont be disappointed!","date":"2025-01-10 18:30:00"},
    {"review_id":"A9","user_id":"U9","business_id":"A","stars":5.0,"text":"From the second you walk in the door, you're greeted by the adorable woman at the counter. It seems if you come in here more than once a week, she'll know you're name but I haven't been so lucky since my visits are a bit more sporadic.\\n\\nMy most recent discovery are the vegetarian breakfast sandwiches, which are served all day! I particularly enjoy veg. sausage w/ havarti on an everything bagel. I could actually go for one right about now... I've also had the veggie club sandwich and my other half has enjoyed the chicken cheesesteak hoagie and the chicken salad on a croissant. Everything always taste fresh, they are priced really well  (I think my favorite bagel sandwich I mentioned is $2.09-2.99- cheaper than wawa!). The people at the deli are super helpful, offering menus if you can't read the one on the wall and will make great suggestions and accommodations to your needs and want.\\n\\nDon't forget to grab a really great snack too while you're there- they have amazing chocolate bars, an incredible drink case, tons of chip varieties and those addictive hi-chew candies in every flavor.\\n\\nI know i'll be back here, who doesn't like fast / delicious / attentive service?","date":"2025-02-14 21:30:00"},
    {"review_id":"A10","user_id":"U10","business_id":"A","stars":4.0,"text":"Love going here for happy hour or dinner!  Great patio with fans to beat the StL heat!   Also...very accomodating at this location.  I like the Veal Milanese but with mixed greens instead of pasta!  they'll modify the menu to suit your taste!","date":"2024-03-05 20:45:00"}
]