[{"review_id":"IxggZMADUbJDT9GRimdUUQ","user_id":"CPTkIeK5aOf16_fE7kRRdw","business_id":"YE2TePip0TxcdquF5hGauQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I tried this place for the first time and I have to say the pork bbq sandwich may the best I've ever had. It was so good! I'll have to try other items on my return visits.","date":"2021-06-12 02:49:34"},
{"review_id":"-bdGXIIKkxq-sckKV129PQ","user_id":"Bc5UcUIAuX9H-GGbtGFcsg","business_id":"YE2TePip0TxcdquF5hGauQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I'm not going to lie, I was not expecting the food to be good. More so because I'm not a huge bbq person, and I've found that everyone is just not good getting down on the grill. But, to my surprise I really enjoyed my food. I ordered the half chicken and it was seasoned PERFECTLY. I also ordered the baked beans because the young lady at the window recommended them. I'm always one to skip baked beans and coleslaw at a bbq, but these beans were good! I asked for my bbq sauce on the side, and even that was good. I'd probably skip the sweet potato pie next time because I didn't really care for that, but it wasn't nasty. Just didn't strike my tastebuds. Overall I was impressed and would return to try the hotdogs.","date":"2021-06-05 00:45:55"},
{"review_id":"yctqBDi6Q1qMa0BMmZHIVA","user_id":"5e5FLH_a2cV3fbJZePGx6g","business_id":"YE2TePip0TxcdquF5hGauQ","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"JUST opened today and I went to try them out. Ordered the Hawg Dog, and Two Thyme Pork sandwich along with coleslaw and baked beans. The taste is delicious for everything! The bread is soft on the sandwich and hot dog, the bacon with the pulled pork adds an extra flavor to it. The place is drive thru which is always a plus. I've got to say I interacted with 3 of the people there and each one was very nice! Seems like a family run business, not sure but I'll definitely be recommending and going back! Congrats on the opening!","date":"2021-03-20 19:03:07"},
{"review_id":"UvuGHB7lMvA-bsack6p-cA","user_id":"Kozzb-tfiVX0CGZR7gT9xg","business_id":"YE2TePip0TxcdquF5hGauQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This is a cool little gem. Family operated and they are very nice. I went on opening day, so they were still working out the kinks - totally understandable. But what I really like is that it's AFFORDABLE BBQ. You won't break the bank eating here (take out only). Fast food prices for food that is prepared daily (you see the smokers out back). I was told they they will expand the menu once they get in the groove, including ribs and rib tips. And Chicagoans, they have Vienna beef dogs!. Worth checking out. Be sure to order sauce on the side, it's not included but it's like 55 cents.","date":"2021-04-03 04:29:11"},
{"review_id":"a3fcfoYbk-6VbrJl2tWGhw","user_id":"l97ckJhdGanCQhEQdIKFHQ","business_id":"YE2TePip0TxcdquF5hGauQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I am very partial to NC BBQ but I must say, JoJo's takes the top spot for BBQ in Sumner County! The sides are also great as well as the sweet potato pie! Mmm mmm so good! Extremely nice family business that we as residents need to support. Small businesses don't make it without you! Give them a try, you won't be disappointed!","date":"2021-09-05 23:11:53"},
{"review_id":"hqPUISOiX0HQPBKabXEk1A","user_id":"M9898ydy4wbGYkE431u2BA","business_id":"YE2TePip0TxcdquF5hGauQ","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"OK, let's start off with the best. Their smoked chicken is the best thing on the menu. The pulled pork was OK I would've wished it had more seasoning. The barbecue sauce got better the more you ate it. It really got good. The hotdogs are just delicious. And the coleslaw is to die for. Make sure you like mayonnaise-based coleslaw. They nailed everything and it only took five minutes in their drive-through to get everything put together. They're really good at customer service. They are also affordable. Video review coming to Jack on the go show on YouTube.","date":"2021-04-25 00:05:57"},
{"review_id":"Lc88zkPFutcry_fQ78iFvw","user_id":"l7m0oJpWaHaHmHXMaKWcVw","business_id":"YE2TePip0TxcdquF5hGauQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Delicious little bbq joint right off the highway in the Dollar General Corporation parking lot. I would have taken a picture but we devoured our food right away. I had the small rib tips which were plenty and my gf had a pulled pork sandwich. The owner came out to make sure we were enjoying the food and told us he named the restaurant after his son JoJo. Love it.","date":"2021-08-07 19:23:29"},
{"review_id":"YmSZCs-FT-XjRlMk3BPPMg","user_id":"yIdSkCrQj_svtpjJvJzWeA","business_id":"YE2TePip0TxcdquF5hGauQ","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Bbq pork sandwiches are ok.  The pork is moist and smokey but needs more flavor. The thyme bacon was still crunchy. \n\nSlaw-too mayo for my taste\nBeans-sweet but good, nice pork pieces\n\nBut the best is the smoke chicken.  The breast is still moist.  My son usually like thighs but he left it on his plate and ate the breast.  Better than Costco rotisserie chicken.\n\nWish they have more side options and that you can get the pork by itself and not on sandwich.","date":"2021-05-02 01:27:25"},
{"review_id":"HrqBnH4CmvcKzgTDZ-bMEQ","user_id":"i3tANLeNrxAnj5LhYJbGQA","business_id":"YE2TePip0TxcdquF5hGauQ","stars":2.0,"useful":0,"funny":0,"cool":0,"text":"Just eh. The slaw was bland. Salt and pepper would help. Received my order through the drive thru quickly, but the Vienna hot dog seemed old and wasn't even warm. I ordered the Vienna Hawt Dawg and was asked what I wanted on it. I said what came with it was fine and read off the BBQ, slaw, and BBQ sauce...  She said it came plain and I could pick what I wanted, so I chose the coleslaw since that was what I was looking forward to most. Bland,  overcooked, not warm. Everything you would expect of a gas station roller dog. Nothing special at all. I won't be back.","date":"2021-11-12 23:50:42"},
{"review_id":"hsj-zy1tUdpT4pa4M8t4pA","user_id":"vNTIw7KCKcRi6s9NJPzGTg","business_id":"YE2TePip0TxcdquF5hGauQ","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"I'm such a big fan of local food and such a big fan of Goodlettsville. I write reluctantly and am adding an extra star because I want you to succeed. \n\nI've visited twice. The first visit I got a whole chicken and the second time I came for a loaded chili-cheese dog.\n\nCustomer service and pricing were great! I liked the dog. The chicken was super disappointing...including not getting the sauce on the side I requested. \n\nThere is a lot of opportunity to turn this around.","date":"2021-10-29 17:10:35"},
{"review_id":"SHwHxFhQq0xcxgIikHEMlA","user_id":"-Q0GhjU3uYX3euNicCYidA","business_id":"YE2TePip0TxcdquF5hGauQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Saw barbecue and large parking lot for our 5th wheeler and knew we couldn't pass this place. Sure glad we didn't!! This was the best barbecue we had in a long time. Staff was the sweetest. We also received a sample of their banana pudding which was also very yummy and recommended. Also added benefit was a drive through. Will definitely return!!","date":"2021-05-12 17:41:39"},
{"review_id":"n-cO00Btm4oB_VL2-WRkhg","user_id":"WkBCSXOnq1MMtc09E2umsA","business_id":"YE2TePip0TxcdquF5hGauQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"We had JoJo's catered to our office for lunch, it was absolutely amazing.  Timothy the owner was great working with, he offered great input on items that was good for the office, which was absolutely correct!.  The chicken BBQ was amazing, so tender and juicy.  The pulled pork was OUT OF THIS WORLD.  Definitely will use them again!","date":"2021-12-28 20:49:54"},
{"review_id":"2KehrqTHrpe1PVwGmpjOUw","user_id":"cYSvqv-8aff_swu54oX3Qw","business_id":"YE2TePip0TxcdquF5hGauQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Probably the best BBQ in middle Tennessee. They actually have a pit and smoke all of their awesome pork shoulders, links, chicken and ribs. Also, their sweet potato pie and baked beans are home made.\n\nThis place is very convenient to I65 so if traveling, take the exit ramp, look for the Dollar General in the former K-Mart building and wa-lah, you're there. They have picnic tables outside if needed.\n\nYou'll love the BBQ sauce. I like their chicken, pulled pork, ribs and links. Try it, you'll like it.","date":"2021-08-20 18:46:57"},
{"review_id":"RdXrPndsUeYKuyHi1ZlMGg","user_id":"RRnjJqxhrY_ixav2QIMX4Q","business_id":"YE2TePip0TxcdquF5hGauQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"So glad we stopped here! On our way to Nashville we saw this place and liking a unique bite every now and then we gave it a go. The Hawg Dog is an experience! Loved it! The baked beans and slaw were both great as well. The best part was that the owner was out of forks and made a trip to the gas station to get us some just so we could eat in the parking lot!","date":"2021-07-11 00:16:06"}]